      /if not defined(COPYRIGHT_DSPEC)
     h COPYRIGHT('V1.15.4 - 01.04.2019 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     d STRPREPRC_VERSION...
     d                 C                   '1.15.4'
     d STRPREPRC_DATE...
     d                 C                   '01.04.2019'
      *
