      /if not defined(COPYRIGHT_DSPEC)
     h COPYRIGHT('V1.19 - 07.01.2021 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     d STRPREPRC_VERSION...
     d                 C                   '1.19.0'
     d STRPREPRC_DATE...
     d                 C                   '07.01.2021'
      *
