      /if not defined(COPYRIGHT_DSPEC)
     h COPYRIGHT('V1.20.2 - 20.11.2021 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     d STRPREPRC_VERSION...
     d                 C                   '1.20.2'
     d STRPREPRC_DATE...
     d                 C                   '20.11.2021'
      *
