**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0037

//  Teildatei &3 von Datei &1 in Bibliothek &2 nicht gefunden.

dcl-ds PRZ0037;
  PRZ00371 char(10) inz(*blanks);
  PRZ00372 char(10) inz(*blanks);
  PRZ00373 char(10) inz(*blanks);
end-ds;
dcl-s PRZ0037_SIZE int(10) inz(30);

