      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0044
      //  Erstellungsbefehl nicht gefunden in Quellendatei &
     d PRZ0044         ds
     d  PRZ00441                    256A   inz
     d  PRZ00442                    256A   inz
     d PRZ0044_SIZE    s             10I 0 inz(512)
