      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0037

      //  Teildatei &3 von Datei &1 in Bibliothek &2 nicht gefunden.

     d PRZ0037         ds
     d  PRZ00371                     10A   inz(*BLANKS)
     d  PRZ00372                     10A   inz(*BLANKS)
     d  PRZ00373                     10A   inz(*BLANKS)
     d PRZ0037_SIZE    s             10I 0 inz(30)

