**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0045
//  Erstellungsbefehl nicht gefunden in Quellendatei &
dcl-ds PRZ0045;
  PRZ00451 char(256) inz;
  PRZ00452 char(256) inz;
end-ds;
dcl-s PRZ0045_SIZE int(10) inz(512);
