      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0031

      //  Ungültige INCLUDE Marke in Zeile &1 gefunden.

     d PRZ0031         ds
     d  PRZ00311                    006P 2 INZ(*ZEROS )
     d PRZ0031_SIZE    s              8B 0 INZ(0004)

