**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0027

// Wenn die Option '*EVENTF' angegeben ist, müssen auch die Pa

dcl-ds PRZ0027;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0027_SIZE bindec(8) inz(0000);

