**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0020

// Der Parameter 'OBJTYPE' muss angegeben werden, wenn CHGOBJD

dcl-ds PRZ0020;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0020_LEN bindec(8) inz(0512);

