**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0029

// &1.

dcl-ds PRZ0029;
  PRZ00291 char(70) inz(*blanks);
end-ds;
dcl-s PRZ0029_LEN bindec(8) inz(0070);

