      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0043
      //  Datei nicht gefunden: &1
     d PRZ0043         ds
     d  PRZ00431                    256A   inz
     d PRZ0043_SIZE    s             10I 0 inz(256)
