      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0009
      *
      * Unbekannter Wert "&1" für Fortsetzungszeichen gefunden.
      *
     D PRZ0009         DS
     D  PRZ00091                    010A   INZ(*BLANKS)
     D PRZ0009_LEN     S              8B 0 INZ(0010)
      *
