      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0015
      *
      * Fehler im Erstellungsbefehl gefunden.
      *
     D PRZ0015         DS
     D  PRZ00151                    512A   INZ(*BLANKS)
     D PRZ0015_LEN     S              8B 0 INZ(0512)
      *
