**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0014

// Auszuführender Befehl fehlt. Weitere Verarbeitung nicht mög

dcl-ds PRZ0014;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0014_LEN bindec(8) inz(0030);

