      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0006
      *
      * Das Ende des Schlüsselwortes &1 konnte nicht gefunden werde
      *
     D PRZ0006         DS
     D  PRZ00061                    010A   INZ(*BLANKS)
     D PRZ0006_LEN     S              8B 0 INZ(0010)
      *
