**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0040
//  Wert *DFT ist unzulässig für SRCFILE, SRCLIB und SRCMBR, we
dcl-ds PRZ0040;
  PRZ00401 char(70) inz(*blanks);
end-ds;
dcl-s PRZ0040_SIZE int(10) inz(70);
