      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0035

      //  Bibliothek &1 nicht gefunden.

     d PRZ0035         ds
     d  PRZ00351                     10A   inz(*BLANKS)
     d PRZ0035_SIZE    s             10I 0 inz(10)

