**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0043
//  Datei nicht gefunden: &1
dcl-ds PRZ0043;
  PRZ00431 char(256) inz;
end-ds;
dcl-s PRZ0043_SIZE int(10) inz(256);
