      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0034

      //  Fehlernachricht &1 wurde aufgrund von MONMSG ignoriert.

     d PRZ0034         ds
     d  PRZ00341                     10A   inz(*BLANKS)
     d PRZ0034_SIZE    s             10I 0 inz(10)

