      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0012
      *
      * Fehler beim Öffnen der Quellendatei &2/&1, Teildatei &3.
      *
     D PRZ0012         DS
     D  PRZ00121                    010A   INZ(*BLANKS)
     D  PRZ00122                    010A   INZ(*BLANKS)
     D  PRZ00123                    010A   INZ(*BLANKS)
     D PRZ0012_LEN     S              8B 0 INZ(0030)
      *
