**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0019

// Der Parameter 'OBJTYPE' ist nicht zulässig, wenn CHGOBJD(*N

dcl-ds PRZ0019;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0019_LEN bindec(8) inz(0512);

