      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0003
      *
      * Parameteranweisung in der Betriebsart &1 unzulässig.
      *
     D PRZ0003         DS
     D  PRZ00031                    030A   INZ(*BLANKS)
     D PRZ0003_LEN     S              8B 0 INZ(0030)
      *
