      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0018
      *
      * Der Parameter 'OBJSRCMBR' ist nicht zulässig, wenn CHGOBJD(
      *
     D PRZ0018         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0018_LEN     S              8B 0 INZ(0512)
      *
