**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0039
//  Entweder USESRCFILE und USESRCMBR oder USESRCSTMF angeben.
dcl-ds PRZ0039;
  PRZ00391 char(70) inz(*blanks);
end-ds;
dcl-s PRZ0039_SIZE int(10) inz(70);
