**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0036

//  Datei &1 in Bibliothek &2 nicht gefunden.

dcl-ds PRZ0036;
  PRZ00361 char(10) inz(*blanks);
  PRZ00362 char(10) inz(*blanks);
end-ds;
dcl-s PRZ0036_SIZE int(10) inz(20);

