      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0038
      //  Die Parameter USESRCFILE und USESRCMBR können nicht mit dem
     d PRZ0038         ds
     d  PRZ00381                     70A   inz(*BLANKS)
     d PRZ0038_SIZE    s             10I 0 inz(70)
