      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0004
      *
      * Die Marke &1 ist außerhalb der Betriebsart &2 nicht erlaubt
      *
     D PRZ0004         DS
     D  PRZ00041                    030A   INZ(*BLANKS)
     D  PRZ00042                    030A   INZ(*BLANKS)
     D PRZ0004_LEN     S              8B 0 INZ(0060)
      *
