**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0003

// Parameteranweisung in der Betriebsart &1 unzulässig.

dcl-ds PRZ0003;
  PRZ00031 char(030) inz(*blanks);
end-ds;
dcl-s PRZ0003_LEN bindec(8) inz(0030);

