**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0016

// Der Parameter 'OBJSRCFILE' ist nicht zulässig, wenn CHGOBJD

dcl-ds PRZ0016;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0016_LEN bindec(8) inz(0512);

