**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0030

// Wenn die Option '*EVENTF' angegeben ist, müssen auch die Pa
// Die Option *ADDJOBLOG ist nur in Verbindung mit *EVENTF zul

dcl-ds PRZ0030;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0030_SIZE bindec(8) inz(0000);

