      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0039
      //  Entweder USESRCFILE und USESRCMBR oder USESRCSTMF angeben.
     d PRZ0039         ds
     d  PRZ00391                     70A   inz(*BLANKS)
     d PRZ0039_SIZE    s             10I 0 inz(70)
