      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0016
      *
      * Der Parameter 'OBJSRCFILE' ist nicht zulässig, wenn CHGOBJD
      *
     D PRZ0016         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0016_LEN     S              8B 0 INZ(0512)
      *
