**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0028

// Erstellungsbefehl nicht gefunden in Quellendatei &2/&1, Teildatei &3.

dcl-ds PRZ0028;
  PRZ00281 char(010) inz(*blanks);
  PRZ00282 char(010) inz(*blanks);
  PRZ00283 char(010) inz(*blanks);
end-ds;
dcl-s PRZ0028_LEN bindec(8) inz(0030);

