**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0035

//  Bibliothek &1 nicht gefunden.

dcl-ds PRZ0035;
  PRZ00351 char(10) inz(*blanks);
end-ds;
dcl-s PRZ0035_SIZE int(10) inz(10);

