**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0008

// Das Zeilenendekennzeichen konnte nicht gefunden werden.

dcl-ds PRZ0008;
  PRZ00081 packed(006: 2) inz(*zeros);
end-ds;
dcl-s PRZ0008_LEN bindec(8) inz(0004);

