**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0015

// Fehler im Erstellungsbefehl gefunden.

dcl-ds PRZ0015;
  PRZ00151 char(512) inz(*blanks);
end-ds;
dcl-s PRZ0015_LEN bindec(8) inz(0512);

