      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0030
      *
      * Wenn die Option '*EVENTF' angegeben ist, müssen auch die Pa
      * Die Option *ADDJOBLOG ist nur in Verbindung mit *EVENTF zul
      *
     D PRZ0030         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0030_SIZE    S              8B 0 INZ(0000)
      *
