      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0021
      *
      * Befehl CHGOBJDA nicht gefunden oder unvollständig.
      *
     D PRZ0021         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0021_LEN     S              8B 0 INZ(0512)
      *
