      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0039

      //  Erstellungsbefehl nicht gefunden in Quellendatenstromdatei

     d PRZ0039         ds
     d  PRZ00391                    512A   inz(*BLANKS)
     d PRZ0039_SIZE    s             10I 0 inz(512)

