**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0033

// STRPREPRC: Objekt erstellt.

dcl-ds PRZ0033;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0033_SIZE bindec(8) inz(0000);

