      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0040
      //  Wert *DFT ist unzulässig für SRCFILE, SRCLIB und SRCMBR, we
     d PRZ0040         ds
     d  PRZ00401                     70A   inz(*BLANKS)
     d PRZ0040_SIZE    s             10I 0 inz(70)
