**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0009

// Unbekannter Wert "&1" für Fortsetzungszeichen gefunden.

dcl-ds PRZ0009;
  PRZ00091 char(010) inz(*blanks);
end-ds;
dcl-s PRZ0009_LEN bindec(8) inz(0010);

