      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0014
      *
      * Auszuführender Befehl fehlt. Weitere Verarbeitung nicht mög
      *
     D PRZ0014         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0014_LEN     S              8B 0 INZ(0030)
      *
