      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0038

      //  Keine Pre-Compiler Anweisungen in Quellendatenstromdatei &1

     d PRZ0038         ds
     d  PRZ00381                    512A   inz(*BLANKS)
     d PRZ0038_SIZE    s             10I 0 inz(512)

