      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0024
      *
      * Keine Pre-Compiler Anweisungen in Quellendatei &2/&1, Teildatei &3 gefunden.
      *
     D PRZ0024         DS
     D  PRZ00241                    010A   INZ(*BLANKS)
     D  PRZ00242                    010A   INZ(*BLANKS)
     D  PRZ00243                    010A   INZ(*BLANKS)
     D PRZ0024_LEN     S              8B 0 INZ(0030)
      *
