      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0002
      *
      * Verarbeitung in Zeile &1 abgebrochen.
      *
     D PRZ0002         DS
     D  PRZ00021                    006P 2 INZ(*ZEROS )
     D PRZ0002_LEN     S              8B 0 INZ(0004)
      *
