**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0044
//  Erstellungsbefehl nicht gefunden in Quellendatei &
dcl-ds PRZ0044;
  PRZ00441 char(256) inz;
  PRZ00442 char(256) inz;
end-ds;
dcl-s PRZ0044_SIZE int(10) inz(512);
