      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0028
      *
      * Erstellungsbefehl nicht gefunden in Quellendatei &2/&1, Teildatei &3.
      *
     D PRZ0028         DS
     D  PRZ00281                    010A   INZ(*BLANKS)
     D  PRZ00282                    010A   INZ(*BLANKS)
     D  PRZ00283                    010A   INZ(*BLANKS)
     D PRZ0028_LEN     S              8B 0 INZ(0030)
      *
