**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0006

// Das Ende des Schlüsselwortes &1 konnte nicht gefunden werde

dcl-ds PRZ0006;
  PRZ00061 char(010) inz(*blanks);
end-ds;
dcl-s PRZ0006_LEN bindec(8) inz(0010);

