      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0013
      *
      * Fehler beim Öffnen der Steuerdatei &2/&1, Teildatei &3.
      *
     D PRZ0013         DS
     D  PRZ00131                    010A   INZ(*BLANKS)
     D  PRZ00132                    010A   INZ(*BLANKS)
     D  PRZ00133                    010A   INZ(*BLANKS)
     D PRZ0013_LEN     S              8B 0 INZ(0030)
      *
