**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0007

// Befehlszeichenfolge ist zu lang.

dcl-ds PRZ0007;
  PRZ00071 packed(010) inz(*zeros);
end-ds;
dcl-s PRZ0007_LEN bindec(8) inz(0006);

