      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0020
      *
      * Der Parameter 'OBJTYPE' muss angegeben werden, wenn CHGOBJD
      *
     D PRZ0020         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0020_LEN     S              8B 0 INZ(0512)
      *
