      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0041
      //  Datei &1 kann nicht geöffnet werden.
     d PRZ0041         ds
     d  PRZ00411                    512A   inz(*BLANKS)
     d  PRZ00412                     10A   inz(*BLANKS)
     d  PRZ00413                     50A   inz(*BLANKS)
     d PRZ0041_SIZE    s             10I 0 inz(572)
