**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0024

// Keine Pre-Compiler Anweisungen in Quellendatei &2/&1, Teildatei &3 gefunden.

dcl-ds PRZ0024;
  PRZ00241 char(010) inz(*blanks);
  PRZ00242 char(010) inz(*blanks);
  PRZ00243 char(010) inz(*blanks);
end-ds;
dcl-s PRZ0024_LEN bindec(8) inz(0030);

