      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0032

      //  Entweder USESRCFILE und USESRCMBR oder USESRCSTMF angeben.

     d PRZ0032         ds
     d  PRZ00321                     70A   inz(*BLANKS)
     d PRZ0032_SIZE    s             10I 0 inz(70)

