      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0029
      *
      * &1.
      *
     D PRZ0029         DS
     D  PRZ00291                     70A   INZ(*BLANKS)
     D PRZ0029_LEN     S              8B 0 INZ(0070)
      *
