**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0002

// Verarbeitung in Zeile &1 abgebrochen.

dcl-ds PRZ0002;
  PRZ00021 packed(006: 2) inz(*zeros);
end-ds;
dcl-s PRZ0002_LEN bindec(8) inz(0004);

