      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0008
      *
      * Das Zeilenendekennzeichen konnte nicht gefunden werden.
      *
     D PRZ0008         DS
     D  PRZ00081                    006P 2 INZ(*ZEROS )
     D PRZ0008_LEN     S              8B 0 INZ(0004)
      *
