**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0041
//  Datei &1 kann nicht geöffnet werden.
dcl-ds PRZ0041;
  PRZ00411 char(512) inz(*blanks);
  PRZ00412 char(10) inz(*blanks);
  PRZ00413 char(50) inz(*blanks);
end-ds;
dcl-s PRZ0041_SIZE int(10) inz(572);
