      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0036

      //  Datei &1 in Bibliothek &2 nicht gefunden.

     d PRZ0036         ds
     d  PRZ00361                     10A   inz(*BLANKS)
     d  PRZ00362                     10A   inz(*BLANKS)
     d PRZ0036_SIZE    s             10I 0 inz(20)

