      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0026
      *
      * EVFEVENT Datei konnte nicht zur Ausgabe vorbereitet werden.
      *
     D PRZ0026         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0026_LEN     S              8B 0 INZ(0512)
      *
