**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0021

// Befehl CHGOBJDA nicht gefunden oder unvollständig.

dcl-ds PRZ0021;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0021_LEN bindec(8) inz(0512);

