**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0034

//  STRPREPRC: Fehlernachricht &1 wurde aufgrund von MONMSG ignoriert.

dcl-ds PRZ0034;
  PRZ00341 char(10) inz(*blanks);
end-ds;
dcl-s PRZ0034_SIZE int(10) inz(10);

