      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0017
      *
      * Der Parameter 'OBJSRCLIB' ist nicht zulässig, wenn CHGOBJD(
      *
     D PRZ0017         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0017_LEN     S              8B 0 INZ(0512)
      *
