      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0034

      //  Datei &1 kann nicht geöffnet werden.

     d PRZ0034         ds
     d  PRZ00341                    512A   inz(*BLANKS)
     d PRZ0034_SIZE    s             10I 0 inz(512)

