**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0022

// Verarbeitung abgebrochen.

dcl-ds PRZ0022;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0022_LEN bindec(8) inz(0512);

