      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0023
      *
      * Fehlender Wert für Variable an Position &1 des auszuführend
      *
     D PRZ0023         DS
     D  PRZ00231                    010P 0 INZ(*ZEROS )
     D  PRZ00232                    512A   INZ(*BLANKS)
     D PRZ0023_LEN     S              8B 0 INZ(0518)
      *
