      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0007
      *
      * Befehlszeichenfolge ist zu lang.
      *
     D PRZ0007         DS
     D  PRZ00071                    010P 0 INZ(*ZEROS )
     D PRZ0007_LEN     S              8B 0 INZ(0006)
      *
