      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0045
      //  Erstellungsbefehl nicht gefunden in Quellendatei &
     d PRZ0045         ds
     d  PRZ00451                    256A   inz
     d  PRZ00452                    256A   inz
     d PRZ0045_SIZE    s             10I 0 inz(512)
