      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0027
      *
      * Wenn die Option '*EVENTF' angegeben ist, müssen auch die Pa
      *
     D PRZ0027         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0027_SIZE    S              8B 0 INZ(0000)
      *
