      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0022
      *
      * Verarbeitung abgebrochen.
      *
     D PRZ0022         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0022_LEN     S              8B 0 INZ(0512)
      *
