      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0025
      *
      * EVFEVENT Datei in Bibliothek &1 oder das Job Protokoll konnte nicht geöffne
      *
     D PRZ0025         DS
     D  PRZ00251                    010A   INZ(*BLANKS)
     D PRZ0025_LEN     S              8B 0 INZ(0010)
      *
