      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0001
      *
      * Falsche Reihenfolge im Betriebsmodus.
      *
     D PRZ0001         DS
     D  PRZ00011                    030A   INZ(*BLANKS)
     D  PRZ00012                    030A   INZ(*BLANKS)
     D PRZ0001_LEN     S              8B 0 INZ(0060)
      *
