**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0026

// EVFEVENT Datei konnte nicht zur Ausgabe vorbereitet werden.

dcl-ds PRZ0026;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0026_LEN bindec(8) inz(0512);

