      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0019
      *
      * Der Parameter 'OBJTYPE' ist nicht zulässig, wenn CHGOBJD(*N
      *
     D PRZ0019         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0019_LEN     S              8B 0 INZ(0512)
      *
