      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0033
      *
      * STRPREPRC: Objekt erstellt.
      *
     D PRZ0033         DS
      *   Keine Ersatzvariablen definiert!
     D PRZ0033_SIZE    S              8B 0 INZ(0000)
      *
