      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0005
      *
      * Ungültiges Fortsetzungszeichen &1 in Zeile &2 gefunden.
      *
     D PRZ0005         DS
     D  PRZ00051                    010A   INZ(*BLANKS)
     D  PRZ00052                    006P 2 INZ(*ZEROS )
     D PRZ0005_LEN     S              8B 0 INZ(0014)
      *
