      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : PRZ0010
      *
      * Modus für Marke &1 nicht definiert.
      *
     D PRZ0010         DS
     D  PRZ00101                    030A   INZ(*BLANKS)
     D PRZ0010_LEN     S              8B 0 INZ(0030)
      *
