**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0031

//  Ungültige INCLUDE Marke in Zeile &1 gefunden.

dcl-ds PRZ0031;
  PRZ00311 packed(006: 2) inz(*zeros);
end-ds;
dcl-s PRZ0031_SIZE bindec(8) inz(0004);

