      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0033

      //  Wert *DFT ist unzulässig für SRCFILE, SRCLIB und SRCMBR, we

     d PRZ0033         ds
     d  PRZ00331                     70A   inz(*BLANKS)
     d PRZ0033_SIZE    s             10I 0 inz(70)

