**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0025

// EVFEVENT Datei in Bibliothek &1 oder das Job Protokoll konnte nicht geöffne

dcl-ds PRZ0025;
  PRZ00251 char(010) inz(*blanks);
end-ds;
dcl-s PRZ0025_LEN bindec(8) inz(0010);

