**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0018

// Der Parameter 'OBJSRCMBR' ist nicht zulässig, wenn CHGOBJD(

dcl-ds PRZ0018;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0018_LEN bindec(8) inz(0512);

