      // ---------------------------------------------------------------
      //  Data structure for message ID: PRZ0042
      //  Record length of IFS source file exceeds maximum.
     d PRZ0042         ds
     d  PRZ00421                     10P 0 inz(*ZEROS )
     d  PRZ00422                     10P 0 inz(*ZEROS )
     d  PRZ00423                    256A   inz(*BLANKS)
     d  PRZ00424                    256A   inz(*BLANKS)
     d PRZ0042_SIZE    s             10I 0 inz(524)
