**free
//---------------------------------------------------------------
// Datenstruktur für Message-ID : PRZ0017

// Der Parameter 'OBJSRCLIB' ist nicht zulässig, wenn CHGOBJD(

dcl-ds PRZ0017;
end-ds;
//   Keine Ersatzvariablen definiert!
dcl-s PRZ0017_LEN bindec(8) inz(0512);

