**free
// ---------------------------------------------------------------
//  Data structure for message ID: PRZ0038
//  Die Parameter USESRCFILE und USESRCMBR können nicht mit dem
dcl-ds PRZ0038;
  PRZ00381 char(70) inz(*blanks);
end-ds;
dcl-s PRZ0038_SIZE int(10) inz(70);
