**free
/if defined(PSTRPREPR3)
/eof
/endif
/define PSTRPREPR3

//  Initialisieren Pre-Prozessor
dcl-pr initialize extproc('STRPREPRC3_initialize');
end-pr;

