      /if defined(PSTRPREPR3)
      /eof
      /endif
      /define PSTRPREPR3

      *  Initialisieren Pre-Prozessor
     D initialize...
     D                 pr
     D                                     extproc('STRPREPRC3_+
     D                                     initialize+
     D                                     ')

